# Цель работы: 

    Изучить основные принципы построения и работы нейронной сети.

# Задание:

    Изучить и освоить теоретический материал.
    Запустить на выполнение программу для простой нейронной сети.


```python

from numpy import exp, array, random, dot

# Входные данные тренировочного набора
training_set_inputs = array([[0, 0, 1], [1, 1, 1], [1, 0, 1], [0, 1, 1]])
# Ожидаемые выходные данные тренировочного набора
training_set_outputs = array([[0, 1, 1, 0]]).T

# Установка случайной начальной синаптической матрицы весов
random.seed(1)
synaptic_weights = 2 * random.random((3, 1)) - 1

# Тренировка нейронной сети
for iteration in range(100):
    # Прямое распространение
    output = 1 / (1 + exp(-(dot(training_set_inputs, synaptic_weights))))
    # Ошибка и коррекция весов
    synaptic_weights += dot(training_set_inputs.T, (training_set_outputs - output) * output * (1 - output))

# Тестирование нейронной сети на новых данных
print(1 / (1 + exp(-(dot(array([1, 0, 0]), synaptic_weights)))))
```

    Добиться корректной работы программы и объяснить полученный результат.
    Вывести график пошагового приближения к полученному значению в точке X = (1, 0, 0) и других точках, выбранных случайным образом.
    Объяснить результат.
    Вывести график пошагового среднеквадратичного отклонения – ошибки приближения к тренировочному датасету.
    Закомментировать строку установки случайной последовательности чисел и для трех последовательных запусков программы вывести финальные значения весовых коэффициентов (не график пошагового приближения к ним!).
    Объяснить поведение весовых коэффициентов и то, как влияет на них начальное приближение.
    Добавить точки в тренировочный датасет. Вывести и объяснить результат.
    Вывести листинг программы в последней версии.
    Описать основные этапы работы нейронной сети.
